조합회로(combinational circuit) : 출력값이 입력에 인가된 신호 값만으로 결정되는 회로
순서회로[순차회로](sequential circuits) : 조합회로와 다른 유형의 회로로, 현재의 입력 값뿐만 아니라 회로의 과거행위에 의해 결정된다. 
  - 순서회로는 논리 신호의 값을 저장하는 저장소자(storage element)를 포함하고 있다.
  - 저장소자의 내용 : 회로의 상태(state) 표현
    ex) 저장소자가 필요한 경우 : 경보장치 제어
      - on/off'= 0 => OFF
      - on/off'= 1 => ON
      - 센서가 바람직하지 못한 이벤트에 반응 => 양의 전압 신호 Set생성 => 경보장치켜짐
      - 센서의 출력이 0으로 돌아가도 계속 경보 상태를 유지해야 한다. 
      - 경보를 끄려면? 수동으로 동작하는 Reset 입력에 의해 OFF
  - 간단한 메모리 소자(그림5.2)
    - 두 개의 인버터로 하나의 루프를 구성한 매우 간단한 저장 소자 회로
    - if A=0, B=1 -> 회로는 영원히 이 상태 유지(feedback loop)
    - 두 개의 가능한 상태를 가질 수 있음
    - 단점) 자신의 상태를 바꾸는 방법이 없어서 비실용적이다. 
    - 자신의 상태를 바꾸면서 행위를 기억하는 유용한 소자를 논리게이트로 만들 수 있다. 
### 5-1 기본래치
- 입력 Set와 Reset은 회로의 상태 Q를 바꾸는 수단을 제공한다.
- 두 개의 NOR게이트가 교차결합(cross-coupled)형태로 연결되어 있음.
- 래치는 피드백 루프로 인하여 기존 상태를 유지한다.
- Qa와 Qb는 서로 컴플리먼트이다.
- 입력의 현재 값에만 의존하여 출력의 값이 결정되는 조합회로(combinational circuit)가 아니므로, 이 표는 진리표(truth table)이 아니라 특성표(characteristic table)라고 한다.
- 특성표
S | R | Qa | Qb |
|---|:---:|---:|---:|
0 | 0 | 0/1 | 1/0 |
0 | 1 | 0 | 1 |
1 | 0 | 1 | 0 |
1 | 1 | 0 | 0 |
| 값 | 의미 | 기본값 |
|---|:---:|---:|
| `static` | 유형(기준) 없음 / 배치 불가능 | `static` |
| `relative` | 요소 자신을 기준으로 배치 |  |
| `absolute` | 위치 상 부모(조상)요소를 기준으로 배치 |  |
| `fixed` | 브라우저 창을 기준으로 배치 |  |




    
